API_Automation_HTTPClient_Soap/API_Automation_HTTPClient_Soap/apidemoproject/test-output/Default suite/reporter-output.html

<h2>Reporter output</h2><table><tr><td>environment type  null</td></tr>
<tr><td>in dev environment</td></tr>
<tr><td>environment type  null</td></tr>
<tr><td>payload <?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Body>
<Multiply xmlns="http://tempuri.org/">
<intA>500</intA>
<intB>200</intB>
</Multiply>
</soap:Body>
</soap:Envelope> </td></tr>
<tr><td>property value for calculator:http://www.dneonline.com/calculator.asmx</td></tr>
<tr><td>property value for Content-Type:text/xml; charset=utf-8</td></tr>
<tr><td>Response Code : 200</td></tr>
<tr><td>recent services <?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><MultiplyResponse xmlns="http://tempuri.org/"><MultiplyResult>100000</MultiplyResult></MultiplyResponse></soap:Body></soap:Envelope></td></tr>
<tr><td>Http code is   200</td></tr>
<tr><td>response payload is   <?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><MultiplyResponse xmlns="http://tempuri.org/"><MultiplyResult>100000</MultiplyResult></MultiplyResponse></soap:Body></soap:Envelope></td></tr>
<tr><td>payload <?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <NumberToWords xmlns="http://www.dataaccess.com/webservicesserver/">
      <ubiNum>500</ubiNum>
    </NumberToWords>
  </soap:Body>
</soap:Envelope> </td></tr>
<tr><td>property value for numberConversion:https://www.dataaccess.com/webservicesserver/NumberConversion.wso</td></tr>
<tr><td>property value for Content-Type:text/xml; charset=utf-8</td></tr>
<tr><td>Response Code : 200</td></tr>
<tr><td>recent services <?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <m:NumberToWordsResponse xmlns:m="http://www.dataaccess.com/webservicesserver/">
      <m:NumberToWordsResult>five hundred </m:NumberToWordsResult>
    </m:NumberToWordsResponse>
  </soap:Body>
</soap:Envelope></td></tr>
<tr><td>Http code is   200</td></tr>
<tr><td>response payload is   <?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <m:NumberToWordsResponse xmlns:m="http://www.dataaccess.com/webservicesserver/">
      <m:NumberToWordsResult>five hundred </m:NumberToWordsResult>
    </m:NumberToWordsResponse>
  </soap:Body>
</soap:Envelope></td></tr>
</table>